/**
 * Created by 1 on 13.10.2016.
 */
public class AttentionProject
{
   /** задачи по жава
    *
0. создание ИИ
1. возведение числа в степень, учесть дробные и отрицательные
2.  написать программу, которая определит можно ли выложить в одну линию все косточки домино.
Если да, то вывести этот вариант решения. (рекурсия, эйлеров путь)
3. Строковый калькулятор
4. Графический калькулятор
    Физические формулы.
    Решение квадратных уравнений.
5. Доделать минер.
6. книжка для плеймаркета
7. метод шифратор, кторый не позволяет роботу использовать программу:
    *рандомно создает слово код рандомной длинный рандомных сиволов при помощи метода рандом
    * исходя из слова - кода, создает уникалный рандом вопрос - просьбу
    * типо введите 6-ой,3-ий ,1-ый символы в верхнем/нижнем регистре через пробел/букву/цифру
8. Чат бот саморазвивайка. Бот задает вопросы элементарные, потом запоминает ответы. Если его спросить тоже самое,
    то он уже ответит.    Это можно осуществить при помощи записи данных в файл, в программе прописать не получится,
    так как после остановки вся программма стирется. В общем нужна память.
    *робот начинает общаться так, словно он плохо обучен, но в режиме диалого можно будет заметить его развитие.
    * То есть сначала он этого не знает и говорит "Ну, я ещё такого не знаю" , а потом говорит :
    * " Ну это я уже выучил, это то - то, то-то."
9. Шифратор. шифровка файлов, собщений. Изменяющийся шифратор.
    10. ИИ - проходящий лабиринт, игра на перегонки с компом.

*/

   public static void main(String[] args)
   {
   }
}
