package com.javarush.task.task01.task0138;

/* 
Любимое стихотворение
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("Мое любимое стихотворение:");
        //напишите тут ваш код
        System.out.println("Звезда судьбы\n" +
                "\n" +
                "О, звёзды на небе, сказать я хочу, \n" +
                "Что вас я люблю как и девушку ту, \n" +
                "С которой расстался в прошедшем году. \n" +
                "\n" +
                "Ваш свет освещает дорогу в ночи, \n" +
                "Но, звёзды вы просто сияние тьмы, \n" +
                "А девушка та была светом судьбы. \n" +
                "\n" +
                "Вы снова, и снова осветите тьму, \n" +
                "Вы снова погасните ближе к утру, \n" +
                "Я девушку эту забыть не могу. \n" +
                "\n" +
                "Гляжу я на небо и звёзды ищу, \n" +
                "Как только стемнеет на небо смотрю. \n" +
                "Однажды увидеть её я хочу. \n" +
                "\n" +
                "Любовь не забудет сердце моё, \n" +
                "Я сам виноват в потере её. \n" +
                "Я, звёзды, не знаю сказать что ещё.");
    }
}